//游戏
const Game = {
	'1' : 'PC蛋蛋',
	'10': '重庆时时彩',
	'20': '北京赛车PK0'
}

//游戏类型
const GameType = {
	'1':'1',
	'10':'10',
	'20':'20'
}

//玩法类型
const MethodType = {
	//幸运28
	'1':{
		'600001':'0-27 数字',
	    '600002':'大、小、单、双',
	    '600003':'波色赔率（红绿蓝）',
	    '600005':'豹子',
	    '600006':'大单、小单、大双、小双',
	    '600007':'极大、极小',
	},
	'10':{
		'700001':'第一球',
        '700002':'第二球',
        '700003':'第三球',
        '700004':'第四球',
        '700005':'第五球',
        '700006':'第一球',
        '700007':'第二球',
        '700008':'第三球',
        '700009':'第四球',
        '700010':'第五球',
        '700011':'龙虎和',
        '700012':'二字定位',
        '700013':'三字定位',
        '700014':'全五一字组合',
        '700015':'前三一字组合',
        '700016':'中三一字组合',
        '700017':'后三一字组合',
        '700018':'前三二字组合',
        '700019':'中三二字组合',
        '700020':'后三二字组合',
        '700021':'二字和值',
        '700022':'前三组选三',
        '700023':'中三组选三',
        '700024':'后三组选三',
        '700025':'前三组选六',
        '700026':'中三组选六',
        '700027':'后三组选六',
        '700028':'前三跨度',
        '700029':'中三跨度',
        '700030':'后三跨度',
        '700031':'定位龙虎和',
        '700032':'一字定位 万位数字盘大小单双质合',
        '700033':'一字定位 千位数字盘大小单双质合',
        '700034':'一字定位 百位数字盘大小单双质合',
        '700035':'一字定位 十位数字盘大小单双质合',
        '700036':'一字定位 个位数字盘大小单双质合',
        '700037':'前三',
        '700038':'中三',
        '700039':'后三',
        '700040':'牛牛',
        '700041':'牛牛双面',
        '700042':'牛牛梭哈'
	},
	'20':{
		'704000':'冠军(第1名)',
        '704001':'亚军(第2名)',
        '704002':'第3名',
        '704003':'第4名',
        '704004':'第5名',
        '704005':'第6名',
        '704006':'第7名',
        '704007':'第8名',
        '704008':'第9名',
        '704009':'第10名',
        '704010':'冠军(第1名)',
        '704011':'亚军(第2名)',
        '704012':'第3名',
        '704013':'第4名',
        '704014':'第5名',
        '704015':'第6名',
        '704016':'第7名',
        '704017':'第8名',
        '704018':'第9名',
        '704019':'第10名',
        '704020':'冠亚和值',
        '704021':'冠亚和值大小单双',
        '704022':'冠亚和值龙虎',
	}
}

//玩法类型分割
const MethodTypeChunk = {
	'1': {
        '两面盘': ['600002', '600003', '600005', '600006', '600007'],
        '猜数字': ['600001']
    },
    '10':{
    	'整合': ['700011','700001', '700002', '700003', '700004', '700005', '700006', '700007', '700008',  '700009',  '700010', '700037', '700038', '700039'],
        '牛牛': ['700040', '700041', '700042'],
    },
    '20':{
    	//'冠亚和值':['704021'],
        //'两面盘1-5': ['704010', '704011', '704012', '704013', '704014'],
        //'两面盘6-10': ['704015', '704016', '704017', '704018', '704019'],
        '双面盘':['704021','704010', '704011', '704012', '704013', '704014','704015', '704016', '704017', '704018', '704019'],
        '冠亚和': ['704020'],
        '1-10': ['704000', '704001', '704002', '704003', '704004','704005', '704006', '704007', '704008', '704009']
    }
}
//具体玩法
const Methods = {
	//幸运28
    "600001": {"type": "num", "chunk":4, "begin": 0, "end": 27, "names":[]},
    "600002": {"type": "text", "chunk":4, "begin": 0, "end": 3, "names":['大', '小', '单', '双']},
    "600003": {"type": "text", "chunk":3, "begin": 0, "end": 2, "names":['红', '绿', '蓝']},
    "600005": {"type": "text", "chunk":1, "begin": 0, "end": 0, "names":['豹子']},
    "600006": {"type": "text", "chunk":4, "begin": 0, "end": 3, "names":['大单', '小单', '大双', '小双']},
    "600007": {"type": "text", "chunk":2, "begin": 0, "end": 1, "names":['极大', '极小']},

    //时时彩
    "700001": {"type": "num", "chunk":3, "begin": 0, "end": 9, "names":[]},
    "700002": {"type": "num", "chunk":3, "begin": 0, "end": 9, "names":[]},
    "700003": {"type": "num", "chunk":3, "begin": 0, "end": 9, "names":[]},
    "700004": {"type": "num", "chunk":3, "begin": 0, "end": 9, "names":[]},
    "700005": {"type": "num", "chunk":3, "begin": 0, "end": 9, "names":[]},
    "700006": {"type": "text", "chunk":3, "begin": 0, "end": 3,/*"end": 5,*/"names":['大', '小', '单', '双', '质', '和']},
    "700007": {"type": "text", "chunk":3, "begin": 0, "end": 3,/*"end": 5,*/"names":['大', '小', '单', '双', '质', '和']},
    "700008": {"type": "text", "chunk":3, "begin": 0, "end": 3,/*"end": 5,*/"names":['大', '小', '单', '双', '质', '和']},
    "700009": {"type": "text", "chunk":3, "begin": 0, "end": 3,/*"end": 5,*/"names":['大', '小', '单', '双', '质', '和']},
    "700010": {"type": "text", "chunk":3, "begin": 0, "end": 3,/*"end": 5,*/"names":['大', '小', '单', '双', '质', '和']},
    "700011": {"type": "text", "chunk":4, "begin": 0, "end": 6,"names":['总大', '总小', '总单', '总双', '龙', '虎', '和']},
    "700037": {"type": "text", "chunk":3, "begin": 0, "end": 4,"names":['豹子', '顺子', '对子', '半顺', '杂六']},
    "700038": {"type": "text", "chunk":3, "begin": 0, "end": 4,"names":['豹子', '顺子', '对子', '半顺', '杂六']},
    "700039": {"type": "text", "chunk":3, "begin": 0, "end": 4,"names":['豹子', '顺子', '对子', '半顺', '杂六']},
    "700040": {"type": "text", "chunk":3,"begin": 0, "end": 10,"names":['无牛', '牛一', '牛二', '牛三', '牛四', '牛五', '牛六', '牛七', '牛八', '牛九', '牛牛']},
    "700041": {"type": "text", "chunk":3, "begin": 0, "end": 5, "names":['大', '小', '单', '双', '质', '合']},
    "700042": {"type": "text", "chunk":3, "begin": 1, "end": 8, "names":['五条', '炸弹', '葫芦', '顺子', '三条', '两对', '单对', '散号']},

    //北京赛车
    "704000": {"type": "num", "chunk":3, "begin": 1, "end": 10, "names":[]},
    "704001": {"type": "num", "chunk":3, "begin": 1, "end": 10, "names":[]},
    "704002": {"type": "num", "chunk":3, "begin": 1, "end": 10, "names":[]},
    "704003": {"type": "num", "chunk":3, "begin": 1, "end": 10, "names":[]},
    "704004": {"type": "num", "chunk":3, "begin": 1, "end": 10, "names":[]},
    "704005": {"type": "num", "chunk":3, "begin": 1, "end": 10, "names":[]},
    "704006": {"type": "num", "chunk":3, "begin": 1, "end": 10, "names":[]},
    "704007": {"type": "num", "chunk":3, "begin": 1, "end": 10, "names":[]},
    "704008": {"type": "num", "chunk":3, "begin": 1, "end": 10, "names":[]},
    "704009": {"type": "num", "chunk":3, "begin": 1, "end": 10, "names":[]},
    "704010": {"type": "text","chunk":3, "begin": 0, "end": 5, "names":['大', '小', '单', '双', '龙', '虎']},
    "704011": {"type": "text","chunk":3, "begin": 0, "end": 5, "names":['大', '小', '单', '双', '龙', '虎']},
    "704012": {"type": "text","chunk":3, "begin": 0, "end": 5, "names":['大', '小', '单', '双', '龙', '虎']},
    "704013": {"type": "text","chunk":3, "begin": 0, "end": 5, "names":['大', '小', '单', '双', '龙', '虎']},
    "704014": {"type": "text","chunk":3, "begin": 0, "end": 5, "names":['大', '小', '单', '双', '龙', '虎']},
    "704015": {"type": "text","chunk":3, "begin": 0, "end": 3, "names":['大', '小', '单', '双']},
    "704016": {"type": "text","chunk":3, "begin": 0, "end": 3, "names":['大', '小', '单', '双']},
    "704017": {"type": "text","chunk":3, "begin": 0, "end": 3, "names":['大', '小', '单', '双']},
    "704018": {"type": "text","chunk":3, "begin": 0, "end": 3, "names":['大', '小', '单', '双']},
    "704019": {"type": "text","chunk":3, "begin": 0, "end": 3, "names":['大', '小', '单', '双']},
    "704020": {"type": "num", "chunk":3, "begin": 3, "end": 19,"names":[]},
    "704021": {"type": "text","chunk":3,"begin": 0,"end": 3,"names":['大', '小', '单', '双']},
    "704022": {"type": "text","chunk":2,"begin": 0,"end": 9,"names":['1vs10龙', '1vs10虎','2vs9龙','2 vs 9 虎','3 vs 8 龙','3 vs 8 虎','4 vs 7 龙','4 vs 7 虎','5 vs 6 龙','5 vs 6 虎']},
}
export {
	Game,
	GameType,
	MethodType,
	MethodTypeChunk,
	Methods
};